In [ ]:
import pandas as pd
import numpy as np

# Loading Data

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/property_data.csv'
                 , na_values = ['na', '--'])

In [ ]:
df.head(10)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0

In [ ]:
df.tail(10)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           NaN        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PID           8 non-null      float64
 1   ST_NUM        7 non-null      float64
 2   ST_NAME       9 non-null      object
 3   OWN_OCCUPIED  8 non-null      object
 4   NUM_BEDROOMS  5 non-null      float64
 5   NUM_BATH      8 non-null      object
 6   SQ_FT         7 non-null      float64
dtypes: float64(4), object(3)
memory usage: 632.0+ bytes

In [ ]:
df.isna().sum().sum()

11

In [ ]:
df.isna().any()

PID              True
ST_NUM           True
ST_NAME         False
OWN_OCCUPIED     True
NUM_BEDROOMS     True
NUM_BATH         True
SQ_FT            True
dtype: bool

In [ ]:
# unique values pada masing2 kolom
for col in df.columns:
    print(f'{col} : {df[col].unique()}')

PID : [1.00001e+08 1.00002e+08 1.00003e+08 1.00004e+08         nan 1.00006e+08
 1.00007e+08 1.00008e+08 1.00009e+08]
ST_NUM : [104. 197.  nan 201. 203. 207. 213. 215.]
ST_NAME : ['PUTNAM' 'LEXINGTON' 'BERKELEY' 'WASHINGTON' 'TREMONT']
OWN_OCCUPIED : ['Y' 'N' '12' nan]
NUM_BEDROOMS : [ 3. nan  1.  2.]
NUM_BATH : ['1' '1.5' nan '2' 'HURLEY']
SQ_FT : [1000.   nan  850.  700. 1600.  800.  950. 1800.]

In [ ]:
#Loop untuk mendeteksi dan menandai nilai hilang
cnt = 0
for row in df['OWN_OCCUPIED']:
    try:
        # Mencoba mengubah entry menjadi integer
        int(row)
        # Jika berhasil, tandai sebagai NaN
        df.loc[cnt, 'OWN_OCCUPIED'] = np.nan
    except ValueError:
        # Jika gagal (entry adalah string), biarkan
        pass

    cnt += 1

print(df)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           NaN        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
df[df['ST_NUM'].isna()]

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH  SQ_FT
2  100003000.0     NaN   LEXINGTON            N           NaN        1  850.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY  950.0

___

In [ ]:
# dataframe nba
df = pd.read_csv('https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/nbaallelo.csv')

___

In [ ]:
further_city_data = pd.DataFrame(    {"revenue": [7000, 3400],
                                      "employee_count": [2, 2]},
                                      index=["New York", "Barcelona"])

In [ ]:
further_city_data

           revenue  employee_count
New York      7000               2
Barcelona     3400               2

In [ ]:
city_data = pd.DataFrame({"revenue": [4200, 6500, 8000],
                          "employee_count": [5, 8, np.nan]},
                          index=["Amsterdam", "Tokyo", "Toronto"])

In [ ]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [ ]:
further_city_data.loc['New York']

revenue           7000
employee_count       2
Name: New York, dtype: int64

In [ ]:
further_city_data.loc[['New York']]

          revenue  employee_count
New York     7000               2

In [ ]:
cities = pd.concat([city_data, further_city_data], axis=0)

In [ ]:
cities

           revenue employee_count
Amsterdam     4200              5
Tokyo         6500              8
Toronto       8000             NA
New York      7000              2
Barcelona     3400              2

In [ ]:
city_countries = pd.DataFrame({"country": ["Holland", "Japan", "Holland", "Canada", "Spain"],
                               "capital": [1, 1, 0, 0, 0]},
                               index=["Amsterdam", "Tokyo", "Rotterdam", "Toronto", "Barcelona"])

In [ ]:
city_countries

           country  capital
Amsterdam  Holland        1
Tokyo        Japan        1
Rotterdam  Holland        0
Toronto     Canada        0
Barcelona    Spain        0

In [ ]:
cities_countries = pd.concat([cities, city_countries], axis=1, join='outer')

In [ ]:
pd.concat([cities, city_countries], axis=1, join='inner')

           revenue employee_count  country  capital
Amsterdam     4200              5  Holland        1
Tokyo         6500              8    Japan        1
Toronto       8000             NA   Canada        0
Barcelona     3400              2    Spain        0

In [ ]:
cities_countries

           revenue employee_count  country  capital
Amsterdam   4200.0              5  Holland      1.0
Tokyo       6500.0              8    Japan      1.0
Toronto     8000.0             NA   Canada      0.0
New York    7000.0              2      NaN      NaN
Barcelona   3400.0              2    Spain      0.0
Rotterdam      NaN            NaN  Holland      0.0

In [ ]:
cities_countries.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Amsterdam to Rotterdam
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   revenue         5 non-null      float64
 1   employee_count  5 non-null      object
 2   country         5 non-null      object
 3   capital         5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 240.0+ bytes

In [ ]:
cities_countries.info

           revenue employee_count  country  capital
Amsterdam   4200.0              5  Holland      1.0
Tokyo       6500.0              8    Japan      1.0
Toronto     8000.0             NA   Canada      0.0
New York    7000.0              2      NaN      NaN
Barcelona   3400.0              2    Spain      0.0
Rotterdam      NaN            NaN  Holland      0.0

In [ ]:
# replace

# fillna (replace missing value)
# cities_countries[['employee_count', 'capital']].fillna(0)

# replace (replace specific value)
cities_countries['employee_count'].replace('NA', 0, inplace=True)
cities_countries.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Amsterdam to Rotterdam
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   revenue         5 non-null      float64
 1   employee_count  5 non-null      float64
 2   country         5 non-null      object
 3   capital         5 non-null      float64
dtypes: float64(3), object(1)
memory usage: 240.0+ bytes